let data = [
	{
		name: "动画",
		sub_types: [
			{
				name: "MAD·AMV",
				tip: "具有一定创作度的动/静画二次创作视频"
			},
			{
				name: "MMD·3D",
				tip: "使用MMD和其他3D软件制作的视频"
			},
			{
				name: "综合",
				tip: "以动画及相关内容为素材的创作"
			},
			{
				name: "短片·手书·配音",
				tip: "颇具特色的短片/手书及ACG相关配音"
			}
		]
	},
	{
		name: "音乐",
		sub_types: [
			{
				name: "原创音乐",
				tip: "由上传者本人参与创作制作或原作者授权代投的歌曲及纯音乐"
			},
			{
				name: "三次元音乐",
				tip: "以三次元商业音乐为主的歌曲及其他音乐相关形式"
			},
			{
				name: "VOCALOID·UTAU",
				tip: "以Vocaloid及UTAU引擎环境为主，运用各种音源进行创作"
			},
			{
				name: "翻唱",
				tip: "非官方性质的人声歌曲演绎"
			},
			{
				name: "OP/ED/OST",
				tip: "由官方发售或公布的实体或非实体专辑和曲目内容"
			},
			{
				name: "演奏",
				tip: "使用各种传统及非传统乐器进行演奏创作"
			},
			{
				name: "音乐选集",
				tip: "以音乐为主要形式的合集类，排行对比类，精选类投稿"
			}
		]
	},
	{
		name: "游戏",
		sub_types: [
			{
				name: "单机联机",
				tip: "以单机或其联机模式为主要内容的相关视频"
			},
			{
				name: "Mugen",
				tip: "使用Mugen引擎制作或与Mugen相关的游戏视频"
			},
			{
				name: "网络游戏",
				tip: "多人在线游戏为主要内容的相关视频"
			},
			{
				name: "GMV",
				tip: "使用游戏内容或CG为素材制作的MV类型的视频"
			},
			{
				name: "音游",
				tip: "通过配合音乐与节奏而进行的音乐类游戏视频"
			},
			{
				name: "电子竞技",
				tip: "电子竞技游戏项目为主要内容的相关视频"
			},
			{
				name: "手机游戏",
				tip: "手机及平板设备平台上的游戏相关视频"
			},
			{
				name: "桌游棋牌",
				tip: "桌游、棋牌、卡牌对战等为主要内容的相关视频"
			}
		]
	},
	{
		name: "娱乐",
		sub_types: [
			{
				name: "综艺",
				tip: "国内外电视或网络自制的综艺正片及精彩剪辑视频"
			},
			{
				name: "Korea相关",
				tip: "Korea音乐舞蹈、综艺不包括韩剧和韩影"
			},
			{
				name: "明星",
				tip: "三次元明星相关的动态、资讯、粉丝向自制剪辑视频"
			}
		]
	},
	{
		name: "电视剧",
		sub_types: [
			{
				name: "连载剧集",
				tip: ""
			},
			{
				name: "完结剧集",
				tip: ""
			},
			{
				name: "特摄",
				tip: ""
			},
			{
				name: "电视剧相关",
				tip: "电视剧杂谈/混剪/预告/花絮及其他相关内容"
			}
		]
	},
	{
		name: "番剧",
		sub_types: [
			{
				name: "完结动画",
				tip: "已完结动画，旧剧场版/OVA/SP/未放送"
			},
			{
				name: "连载动画",
				tip: "连载中动画，新剧场版/OVA/SP/未放送"
			},
			{
				name: "资讯",
				tip: "ACG类资讯视频"
			},
			{
				name: "官方延伸",
				tip: "EVENT/生放送/DRAMA/RADIO等"
			}
		]
	},
	{
		name: "电影",
		sub_types: [
			{
				name: "电影相关",
				tip: "电影杂谈/混剪/预告/花絮及其他相关内容"
			},
			{
				name: "其他国家",
				tip: ""
			},
			{
				name: "综合",
				tip: ""
			},
			{
				name: "欧美电影",
				tip: ""
			},
			{
				name: "日本电影",
				tip: ""
			},
			{
				name: "国产电影",
				tip: ""
			}
		]
	},
	{
		name: "科技",
		sub_types: [
			{
				name: "纪录片",
				tip: "非电影性质的完整纪录片"
			},
			{
				name: "演讲• 公开课",
				tip: "演讲、或有教育认证机构的课程视频"
			},
			{
				name: "星海",
				tip: "军事相关视频"
			},
			{
				name: "机械",
				tip: "机械设备展示或制作视频"
			},
			{
				name: "野生技术协会",
				tip: "技能演示及学习心得经验分享，或展示一定改装/创作的视频"
			},
			{
				name: "趣味科普人文",
				tip: "包含科普内容、或拍摄传统人文/自然风景的视频"
			}
		]
	},
	
	{
		name: "鬼畜",
		sub_types: [
			{
				name: "鬼畜调教",
				tip: "使用音素材达到与BGM具有一定同步感的视频"
			},
			{
				name: "音MAD",
				tip: "使用音频素材来达到还原原曲的视频"
			},
			{
				name: "人力VOCALOID",
				tip: "以人力VOCALOID为主体的视频"
			},
			{
				name: "教程演示",
				tip: "鬼畜相关的科普和教程演示"
			}
		]
	},
	{
		name: "舞蹈",
		sub_types: [
			{
				name: "宅舞",
				tip: "与ACG相关的翻跳、原创舞蹈"
			},
			{
				name: "三次元舞蹈",
				tip: "以三次元音乐作为BGM的舞蹈"
			},
			{
				name: "舞蹈教程",
				tip: "动作分解，基础教程等具有教学意义的舞蹈视频"
			}
		]
	},
	{
		name: "时尚",
		sub_types: [
			{
				name: "美妆",
				tip: "涵盖妆容、发型、美甲等教程，彩妆、护肤相关产品测评、分享等"
			},
			{
				name: "服饰",
				tip: "服饰风格、穿搭技巧的教程与展示"
			},
			{
				name: "资讯",
				tip: "秀场时装周、杂志大片、品牌短片、潮流趋势等"
			},
			{
				name: "健身",
				tip: "器械、有氧、拉伸运动等，以达到强身健体、减肥瘦身、形体塑造目的"
			}
		]
	},
	{
		name: "生活",
		sub_types: [
			{
				name: "日常",
				tip: "一般日常向的生活类视频"
			},
			{
				name: "动物圈",
				tip: "可爱的、萌萌哒的宠物相关视频"
			},
			{
				name: "美食圈",
				tip: "各式料理制作教程相关视频"
			},
			{
				name: "搞笑",
				tip: "各种搞笑傻缺视频以及栏目"
			},
			{
				name: "手工",
				tip: "简易手工艺品的diy制作视频，例如；折纸、手账、橡皮章等"
			},
			{
				name: "绘画",
				tip: "绘画爱好者们关于绘画技巧、绘图过程的分享交流场所"
			},
			{
				name: "运动",
				tip: "一般向运动项目以及惊险刺激的户外极限运动"
			},
			{
				name: "其他",
				tip: "无法判断分区归属的视频"
			}
		]
	},
	{
		name: "广告",
		sub_types: [
			{
				name: "广告",
				tip: "各种好玩有趣的原生广告/静画二次创作视频"
			}
		]
	},
	{
		name: "国创",
		sub_types: [
			{
				name: "国产动画",
				tip: "国产动画，动态漫画，独立动画短片"
			},
			{
				name: "国产原创相关",
				tip: "以国产动画、漫画为素材的二次创作"
			},
			{
				name: "布袋戏",
				tip: "布袋戏以及相关剪辑节目"
			},
			{
				name: "资讯",
				tip: "原创国产动画、漫画的相关资讯、宣传节目等"
			}
		]
	}
];

export function getVTypes () {
	return data;
}
